
import { Question } from '../types';

export const questions: Question[] = [
  {
    id: 1,
    question: "Какое из следующих веществ является оксидом?",
    type: 'single',
    options: ['HCl', 'NaOH', 'CO₂'],
    answer: '',
  },
  {
    id: 2,
    question: "Какая группа периодической таблицы содержит щелочные металлы?",
    type: 'single',
    options: ['1 группа', '2 группа', '17 группа'],
    answer: '',
  },
  {
    id: 3,
    question: "Как называется реакция, в результате которой образуется соль и вода?",
    type: 'single',
    options: ['Гидролиз', 'Нейтрализация', 'Окисление'],
    answer: '',
  },
  {
    id: 4,
    question: "Какое из следующих соединений является амфотерным?",
    type: 'single',
    options: ['ZnO', 'K₂O', 'SO₂'],
    answer: '',
  },
  {
    id: 5,
    question: "Какие из следующих веществ являются углеводородами?",
    type: 'multiple',
    options: ['CH₄', 'H₂O', 'C₂H₆', 'NaCl'],
    answer: [],
  },
  {
    id: 6,
    question: "Какой элемент имеет наибольшую электроотрицательность?",
    type: 'single',
    options: ['Фтор (F)', 'Кислород (O)', 'Азот (N)'],
    answer: '',
  },
  {
    id: 7,
    question: "Что произойдет с химическим равновесием в системе, если увеличить концентрацию одного из реагентов?",
    type: 'single',
    options: ['Равновесие сместится в сторону продуктов', 'Равновесие сместится в сторону реагентов', 'Равновесие не изменится'],
    answer: '',
  },
  {
    id: 8,
    question: "Какое вещество можно получить реакцией нейтрализации соляной кислоты (HCl) и гидроксида натрия (NaOH)?",
    type: 'single',
    options: ['NaCl', 'NaHCO₃', 'Na₂CO₃'],
    answer: '',
  },
  {
    id: 9,
    question: "Какая форма кристаллической решетки характерна для алмаза?",
    type: 'single',
    options: ['Гексагональная', 'Кубическая алмазоподобная', 'Тетрагональная'],
    answer: '',
  },
  {
    id: 10,
    question: "Объясните, почему вода является хорошим растворителем для многих ионных и полярных соединений.",
    type: 'text',
    answer: '',
  },
];
